youbaidd/esp32-tiltmaze/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# 16 MB QIO flash. Custom table: this game lives in "factory" alongside a
# launcher (also factory, on its own build) and up to 8 other games in
# ota_0..ota_7 slots - see partitions_launcher.csv and the launcher project's
# README for the multi-slot boot scheme.
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_launcher.csv"

# Octal PSRAM, matching the board's fitted memory.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

CONFIG_COMPILER_OPTIMIZATION_PERF=y

# 1 kHz tick so the physics and render tasks can pace themselves precisely.
CONFIG_FREERTOS_HZ=1000

CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
